Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The following methods will run an aggregate method on the first column of matching elements, and return the result:
ja: 次のメソッドは、マッチしたエレメントの最初のカラムで集計メソッドを実行し、その結果を返します。

source: The following model methods have been deprecated in Craft 3, and will be completely removed in Craft 4:
ja: 次のモデルメソッドは Craft 3 で非推奨となり、Craft 4 で完全に削除されます。

source: The following params are now deprecated in Craft 3, and will be completely removed in Craft 4:
ja: 次のパラメータは Craft 3 で非推奨となり、Craft 4 で完全に削除されます。

source: The following params have been removed:
ja: 次のパラメータは削除されました。

source: The following template can be used to provide a RSS 2.0 feed on your site.
ja: 次のテンプレートは、あなたのサイトで RSS 2.0 フィードを提供するために使用できます。

source: The following template can be used to provide an Atom 1.0 feed on your site.
ja: 次のテンプレートは、あなたのサイトで Atom 1.0 フィードを提供するために使用できます。

source: The following template functions have been deprecated in Craft 3, and will be completely removed in Craft 4:
ja: 次のテンプレートファンクションは Craft 3 で非推奨となり、Craft 4 で完全に削除されます。

source: The following template functions have been removed:
ja: 次のテンプレートファンクションは削除されました。

source: The following tokens are available to the URI setting:
ja: URI 設定では、次のトークンが利用可能です。

source: The format of the category URI
ja: カテゴリ URI 形式

source: The group selection won't have any impact on your site's functionality.
ja: グループの選択により、サイトの機能に影響することはありません。

source: The height (in pixels) that the resulting assets must have
ja: 結果となるアセットが持つべき（ピクセル単位の）高さ

source: The last name that the resulting users must have
ja: 結果となるユーザーが持つべきラストネーム

source: The main benefits of Craft Plugins over Yii Modules are:
ja: Yii モジュール上の Craft プラグインの主なメリットは、次の通りです。

source: The maximum number of levels that results may be separated from ancestorOf
ja: ancestorOf によって分割される結果の最大レベル

source: The maximum number of levels that results may be separated from descendantOf
ja: descendantOf によって分割される結果の最大レベル

source: The migration file contains a class with two methods: safeUp() and safeDown().
ja: マイグレーションファイルには、safeUp() と safeDown() という2つのメソッドを持つクラスが含まれています。

source: The modal has the following settings:
ja: モーダルの設定は、次の通りです。

source: The modal will close, revealing your new route on the page.
ja: モーダルが閉じ、ページに新しいルートが表示されるでしょう。

source: The multi-site feature in Craft is for sites with the same publishing team.
ja: Craft のマルチサイト機能は、同じパブリッシングチームを持つサイトに向いています。

source: The name of the ElementInterface class
ja: ElementInterface クラスの名前

source: The name of the column by which the query results should be indexed by
ja: クエリ結果のインデックスに利用するカラム名

source: The name of your site, as defined in Settings → Sites.
ja: 「設定 > サイト」で定義されている、サイトの名前。

source: The new category will have a hierarchical relationship with its parent.
ja: 新しいカテゴリは、親カテゴリと階層的な関係を持ちます。

source: The new field will then be available to assign to the Field Layout of your Category Group.
ja: 新しいフィールドは、カテゴリグループのフィールドレイアウトに割り当てられるようになります。

source: The only Craft-specific addition is support for template routes (['template' => 'some/template']).
ja: Craft が独自に追加しているのは、テンプレートのルート（['template' => 'some/template']）のサポートだけです。

source: The options defined here will be passed into new GuzzleHttp\Client instances.
ja: ここで定義されたオプションは、新しい GuzzleHttp\Client インスタンスに渡されます。

source: The owner element ID(s) that the resulting Matrix blocks must belong to
ja: 結果となる行列ブロックが属するべきオーナーエレメント ID

source: The parameters should be set with chained method calls, like so:
ja: パラメータは、次のように連結したメソッドコールとしてセットする必要があります。

source: The path to vendor/craftcms/cms/lib/
ja: vendor/craftcms/cms/lib/ のパス

source: The path to vendor/craftcms/cms/src/
ja: vendor/craftcms/cms/src/ のパス

source: The path to the folder that contains the index.php file that was loaded for the request
ja: リクエストのために読み込まれた index.php ファイルを含むフォルダのパス

source: The path to your config/ folder
ja: config/ フォルダのパス

source: The path to your migrations/ folder
ja: migrations/ フォルダのパス

source: The path to your storage/ folder
ja: storage/ フォルダのパス

source: The path to your storage/runtime/ folder
ja: storage/runtime/ フォルダのパス

source: The path to your templates/ folder
ja: templates/ フォルダのパス

source: The path to your translations/ folder
ja: translations/ フォルダのパス

source: The path to your vendor/ folder
ja: vendor/ フォルダのパス

source: The permission that the resulting users must have
ja: 結果となるユーザーが持つべき権限

source: The permissions Craft comes with are:
ja: Craft の権限は次の通りです。

source: The purpose of the with param is to tell Craft which sub-elements you’re going to be needing in advance, so that it can fetch them all up front, in as few queries as possible.
ja: with パラメータの目的は、必要とするサブエレメントを事前に Craft へ伝えることで、可能な限り少ないクエリですべてのエレメントを前もって取得できるようにすることです。

source: The reason for this is that Matrix fields can have multiple sub-fields that each share the same handle, as long as they’re in different block types.
ja: この理由は、異なるブロックタイプである限り、行列フィールドでは同じハンドルを共有する複数のサブフィールドをそれぞれに持つことができるためです。

source: The reference code(s) used to identify the element(s)
ja: エレメントの識別に利用する参照コード

source: The rendering result will be saved as the entry’s URI in the system.
ja: レンダリング結果は、システムのエントリ URI として保存されます。

source: The request doesn’t necessarily end after a controller call.
ja: リクエストが、コントローラーの呼び出し後に必ずしも終了するとは限りません。

source: The requested site, represented by a object.
ja: オブジェクトで表される、リクエストされたサイト。

source: The requested site, represented by a craft\models\Site object.
ja: craft\models\Site オブジェクトで表される、リクエストされたサイト。

source: The root project path (same as the CRAFT_BASE_PATH PHP constant)
ja: ルートプロジェクトのパス（PHP 定数の CRAFT_BASE_PATH と同じ）

source: The same template could also be expressed with this syntax:
ja: 同じテンプレートは次の構文で表すこともできます。

source: The search term to filter the resulting elements by
ja: 結果となるエレメントをフィルタするための検索用語

source: The second step is to enter your database connection information.
ja: 2つ目のステップは、データベース接続情報の入力です。

source: The section ID(s) that the resulting entries must be in
ja: 結果となるエントリが含まれるべきセクション ID

source: The site ID that the elements should be returned in
ja: 返されるべきエレメントのサイト ID

source: The site ID that the resulting Matrix blocks must have been defined in, or ':empty:' to find blocks without an owner site ID
ja: 結果となる行列ブロックが定義されるべきサイト ID、または、オーナーサイト ID のないブロックを見つけるための ':empty:'

source: The site name is what you defined at time of installation, and the handle is default.
ja: サイト名はインストール時に定義され、ハンドルは default となります。

source: The size (in bytes) that the resulting assets must have
ja: 結果となるアセットが持つべき（バイト単位の）サイズ

source: The slug that resulting elements must have
ja: 結果となるエレメントが持つべきスラグ

source: The starting point composer.json file that should be used for all Craft projects.
ja: すべての Craft プロジェクトで使用する必要がある、出発点の composer.json ファイルです。

source: The status(es) that the resulting elements must have
ja: 結果となるエレメントが持つべきステータス

source: The strength of Craft comes from its varied community, people from a wide range of backgrounds.
ja: Craft の強みは広範囲のバックグラウンドを持つ人々による多彩なコミュニティから来ています。

source: The structure ID that should be used to join in the structureelements table
ja: structureelements デーブルの結合に利用されるストラクチャー ID

source: The structure of your templates is completely up to you – you can put templates at the root of that folder, within subdirectories, or within subdirectories’ subdirectories (and on and on).
ja: テンプレートの構造は、完全にあなた次第です。 – テンプレートは、フォルダのルート、サブディレクトリ内、またはサブディレクトリのサブディレクトリ内（さらに続く）などに置くことができます。

source: The success message shown after loading Craft with Composer
ja: Composer で Craft をロード後に表示される成功メッセージ

source: The syntax for eager-loading relations from Matrix blocks is a little different than other contexts.
ja: 行列ブロックから関連フィールドを eager-loading するための構文は、他のコンテキストと少し異なります。

source: The syntax for reference tags looks like this:
ja: リファレンスタグの構文は、次のようになります。

source: The syntax is the variable name followed by a pipe (|) followed by the filter name:
ja: 構文は、変数名に続けてパイプ（|）とフィルタ名となります。

source: The tag group ID(s) that the resulting tags must be in
ja: 結果となるタグが含まれるべきタググループ ID

source: The tag group ID(s) that the resulting users must be in
ja: 結果となるユーザーが含まれるべきユーザーグループ ID

source: The third step of the installer is to create a user account.
ja: インストーラーの3つ目のステップは、ユーザーアカウントの作成です。

source: The third step of the installer is to create an admin account.
ja: インストーラーの3つ目のステップは、管理者アカウントの作成です。

source: The title that resulting elements must have
ja: 結果となるエレメントが持つべきタイトル

source: The user ID(s) that the resulting entries’ authors must have
ja: 結果となるエントリの投稿者が持つべきユーザー ID

source: The user account you create during installation is an admin by default.
ja: インストール中に作成したユーザーアカウントが、デフォルトで管理者になります。

source: The user can have the permission either directly or through one of their user groups.
ja: ユーザーは、直接またはユーザーグループの1つを通して権限を持つことができます。

source: The user group ID(s) that the resulting entries’ authors must be in
ja: 結果となるエントリの投稿者が含まれるべきユーザーグループ ID

source: The user submitting the entry will also need to have the permission necessary to create entries for the section they are posting to.
ja: エントリを送信するユーザーは、そのセクションのエントリを作成するための権限を持っている必要があります。

source: The username that the resulting users must have
ja: 結果となるユーザーが持つべきユーザーネーム

source: The value of the "year" token will also be available to the template as a variable called year.
ja: "year" トークンの値は、year と呼ばれる変数としてテンプレートで利用可能です。

source: The volume ID(s) that the resulting assets must be in
ja: 結果となるアセットが含まれるべきアセット ID

source: The width (in pixels) that the resulting assets must have
ja: 結果となるアセットが持つべき（ピクセル単位の）幅

source: The wizard will take you through a couple setup screens, and then perform the installation of Craft.
ja: ウィザードはいくつかのセットアップ画面を表示し、Craft のインストールを実行します。

source: The “Default Upload Location” setting, and the “Upload Location” setting that replaces it if “Restrict uploads to a single folder?” is checked, support dynamic subfolder paths.
ja: 「既定のアップロードロケーション」と「アップロードを単一のフォルダに制限しますか？」をオンにしたときに置き換えられる「ロケーションをアップロードする」は、動的なサブフォルダパスをサポートしています。

source: The “Position Select” field type has been removed from Craft 3.
ja: 「位置選択」フィールドタイプは Craft 3 で削除されました。

source: The “Rich Text” field type has been removed from Craft 3, in favor of new Redactor and CKEditor plugins.
ja: 「リッチテキスト」フィールドタイプは Craft 3 から削除され、新しい Redactor プラグインと CKEditor プラグインが追加されました。

source: Their syntax always begins with “{%” and ends with “%}”.
ja: 構文は常に {% で始まり %} で終わります。

source: Their syntax always begins with “{{” and ends with “}}”.
ja: 構文は常に {{ で始まり }} で終わります。

source: Then configure Craft’s cache component to use it:
ja: 次に、Craft の cache コンポーネントでそれを利用するよう設定します。

source: Then open up your .env file (you may need to use an app like Transmit to do this if you’re running macOS), and find this line:
ja: そして、（macOS であれば、Transmit のようなアプリを利用して）.env ファイルを開き、次の行を探してください。

source: Then run the following command to generate a new content migration file (replacing with your migration name):
ja: 次のコマンドを実行し、新しいコンテンツマイグレーションファイルを生成します（ を実際のマイグレーション名に置き換えます）。

source: Then run the following command to generate a new content migration file (replacing MIGRATION_NAME with your migration name):
ja: 次のコマンドを実行し、新しいコンテンツマイグレーションファイルを生成します（MIGRATION_NAME を実際のマイグレーション名に置き換えます）。

source: Then the entries are automatically populated with their respective related assets.
ja: そして、エントリにはそれぞれに関連づけられたアセットのデータが自動的に入ります。

source: Then you can create a registration form on the front end, like this:
ja: そして、次のようなフロントエンドの登録フォームを作成します。

source: Then you can install it like any other package, by just passing its package name to Composer’s require command.
ja: そうすれば、Composer の require コマンドにパッケージ名を渡すだけで、他のパッケージと同様にインストールできます。

source: Then you can pass that object into your AssetFileModel’s getUrl(), getWidth(), and getHeight() functions:
ja: 次に、そのオブジェクトをアセットモデルの getUrl()、getWidth()、および getHeight() ファンクションへ渡します。

source: Then you can pull them into the alias definitions using getenv():
ja: getenv() を使用して、エイリアスの定義にセットすることができます。

source: Then, on whatever template your form submits to (e.g. search/results.html), just pull the search query from the GET/POST data, and pass it to the search
ja: 次に、フォームの送信先にあたるテンプレート（例：search/results.html）で GET / POST データから検索クエリを取り出し、それを search

source: There are also some cases where it’s not a good idea to use them:
ja: それらを使用するのがよいアイデア ではない 場合のいくつかの例です。

source: There are different types of variables – strings, arrays, booleans, and objects.
ja: 変数には、文字列、配列、ブール値、オブジェクトなど、いろいろな種類があります。

source: There are more security implications than other Twig-specific variables and functions, and your templates will be more susceptible to breaking changes during major Craft version bumps.
ja: 他の Twig 特有の変数やファンクションよりもセキュリティの上で意味があります。さらに、Craft のメジャーバージョン間で生じる互換性を破る変更に、テンプレートを反応させやすくするでしょう。

source: There are multiple ways to do that:
ja: そのためには複数の方法があります。

source: There are new requirements for running Craft 3 and a new installation process, too.
ja: Craft 3 を動作させるにあたって、新しい条件とインストール手順が載っています。

source: There are several learning resources available online for learning Twig:
ja: Twig を学ぶためにオンラインで利用できるいくつかの学習リソースがあります。

source: There are several times when you’ll need to enter a path to one of your templates:
ja: テンプレートのパスを入力する必要があるときが、いくつかあります。

source: There are three different Section Types in Craft: Channels, Structures, and Singles.
ja: Craft には3つの異なるセクションタイプ（チャンネル、ストラクチャー、シングル）があります。

source: There are three types of tags in Twig:
ja: Twig には3種類のタグがあります。

source: There are two cases where inReverse() won’t work as expected, though:
ja: inReverse() が期待した通りに動作しないケースが2つあります。

source: There are two ways to execute content migrations: from the terminal, and from the Migrations utility in the Control Panel.
ja: コンテンツマイグレーションの実行には、ターミナルからとコントロールパネルのマイグレーションユーティリティからの2つの方法があります。

source: There are two ways you can go about updating Craft, depending on whether you want to keep your current directory structure, or switch things up to be more like a new Craft 3 installation.
ja: 既存のディレクトリ構成を維持するか、新規の Craft 3 インストールに似た新しい構成へ切り替えるかによって、Craft のアップデートには2つの方法があります。

source: There might be times when you need to factor multiple types of relations into the mix.
ja: 複数のタイプのリレーションを組み合わせる必要がある場合があります。

source: There’s no reason to wrap those links in conditionals since there will always be a first and last page.
ja: 最初と最後のページは常に存在するため、条件文でこれらをラップする理由はありません。

source: There’s no shortcut syntax for those, so if you want to use a conditional on one of the entry’s properties, you will need to reference it with the object variable:
ja: ショートカット構文がないため、エントリプロパティの1つで条件分岐する場合、変数 object で参照する必要があります。

source: These are a large components that you'll use to implement your website's content.
ja: これらは、ウェブサイトのコンテンツを実装するために利用する大きなコンポーネントです。

source: These are correct:
ja: こちらは正しいです。

source: These are the requirements to successfully install and properly run Craft.
ja: これらは Craft を正常にインストールし、適切に動作させるための要件です。

source: These examples are incorrect:
ja: これらの例は、正しくありません。

source: These include:
ja: これには次ものが含まれます。

source: These three pieces of documentation will help you have a better understanding of how Craft works.
ja: これら3つのドキュメントは、どのように Craft が作用するかをあなたがより理解する上で手助けになるでしょう。

source: These will be the first items you'll encounter in any new Craft-powered website build.
ja: これらは、Craft ベースでいかなるウェブサイトを構築する際にもあなたが遭遇するであろう、最初の項目です。

source: These will be the first three items you'll encounter in any new Craft-powered website build.
ja: これらは、Craft ベースでいかなるウェブサイトを構築する際にもあなたが遭遇するであろう、最初の3つの項目です。

source: They are displayed in the site’s timezone, however they get stored in UTC like all other dates in Craft.
ja: それらは、サイトのタイムゾーンで表示されますが、Craft の他のすべての日付と同様に UTC で格納されます。

source: They are no longer automatically available if a parent template is including them, or even if they were defined in the same template file.
ja: 親テンプレートでインクルードしている場合だけでなく、同じテンプレートファイルで定義されているときでさえも、自動的に利用することはできません。

source: They are not functions.
ja: それらはファンクションではありません。

source: They are organized into Field Groups for convenience, but Field Groups have very little relevance anywhere else in the system.
ja: それらは、便宜上フィールドグループ内に整理されていますが、フィールドグループはシステムの他の場所との関連性をほとんど持ちません。

source: They are there to help contextualize the Craft feature and make it easier for you to understand how to implement it on your own site.
ja: Craft の特徴を状況に応じて考えることを助け、あなた自身のサイトへどのように実装すればよいかの理解を容易にします。

source: They can also be hierarchical.
ja: それらは階層構造を持つこともできます。

source: They can be simple, serving a single purpose like providing a new Dashboard widget type, or they can be complex, introducing entirely new concepts to the system, like an e-commerce application.
ja: それらはシンプルで、新しいダッシュボードウィジェットタイプを提供するようなシンプルな目的を満たすか、 Eコマースアプリケーションのような完全に新しいコンセプトをシステムに導入するような複雑であり得ます。

source: They can be used in any textual fields, including Text cells within a Table field.
ja: テーブルフィールド内のテキストセルを含む、あらゆるテキストフィールドで使用できます。

source: They can set variables, test conditionals, loop through arrays, and much more.
ja: 変数を設定したり、条件文をテストしたり、配列をループしたり、他にもいろいろなことができます。

source: They have several custom parameters, and they abstract away all the complexities of the actual SQL query needed to fetch the elements.
ja: いくつのカスタムパラメータがあり、エレメントを取得するのに必要な実際の SQL クエリの複雑さをすべて抽象化します。

source: They live in Asset Volumes, which represent physical directories.
ja: それらは、物理的なディレクトリに相当するアセットボリュームの中にいます。

source: They must also be converted to the new named parameter syntax (<ParamName:RegExp>).
ja: 新しい名前付けされたパラメータ構文（<ParamName:RegExp>）に変換しなければなりません。

source: They should be kebab-cased.)
ja: kebab-cased にすべきです。）

source: They will be represented as objects.
ja: それらは オブジェクトとして表されます。

source: They will be represented as craft\elements\GlobalSet objects.
ja: それらは、craft\elements\GlobalSet オブジェクトとして表されます。

source: They're a convenient way to make non-Entry content easily editable via the Control Panel.
ja: これは、コントロールパネル経由でエントリではないコンテンツを簡単に編集できるようにする便利な方法です。

source: This applies if the Matrix blocks themselves are being eager-loaded, too.
ja: これは行列ブロック自体が eager-loaded されている場合にも、当てはまります。

source: This behavior has changed in Craft 3, though.
ja: しかし、この動作は Craft 3 で変更されました。

source: This can be a fully-qualified element class name (e.g. craft\elements\Entry) or the element type’s “reference handle”.
ja: これは完全修飾のエレメントクラス名（例：craft\elements\Entry）、または、エレメントタイプの「リファレンスハンドル」です。

source: This can be an actual array, or an ElementCriteriaModel object.
ja: これは実際の配列、または ElementCriteriaModel オブジェクトです。

source: This can be either a string (e.g. 'foo=1&bar=2') or an object (e.g. {foo:'1', bar:'2'}).
ja: これは文字列（例：'foo=1&bar=2'）またはオブジェクト（例：{foo:'1', bar:'2'}）が利用可能です。

source: This can begin with one of your autoload namespaces, formatted as a (e.g. @vendorname/foo).
ja: （例： @vendorname/foo） としてフォーマットされた autoload 名前空間の1つから始めることができます。

source: This code applies equally to founders, mentors and those seeking help and guidance.
ja: この規約は創設者や指導者はもちろん、助けや案内を求めている人たちに等しくあてはまります。

source: This code can be simplified using the `{% switch %}` tag.
ja: このコードは `{% switch %}` タグを利用して、簡略化できます。

source: This code can be simplified using the switch tag.
ja: このコードは switch タグを利用して、簡略化できます。

source: This code of conduct applies to all spaces used by the Craft community for communication.
ja: Craft のコミュニティがコミュニケーションのために利用するすべての場所で、この行動規範はあてはまります。

source: This command will run you through a similar wizard as in the web browser but all from the command line.
ja: このコマンドはウェブブラウザと同様のウィザードを実行しますが、すべてコマンドラインから実行されます。

source: This determines what type of field it is – what its input UI is going to look like, what type of data it can store, and how you’ll be able to interact with that data from your templates.
ja: これは、フィールドがどんな種類か（入力 UI の外観、格納可能なデータ型、テンプレートからデータをどのようにやりとりできるか）を決定します。

source: This directory represents your web root.
ja: このディレクトリはウェブルートを表します。

source: This documentation is for you.
ja: これはあなたのためのドキュメントです。

source: This field will either return a 1 or 0 from the database, so you can test if it is in the on position from a template like so:
ja: このフィールドは、データベースから 1 または 0 のいずれかを返します。そのため、on の状態にあるかどうかを次のようにテンプレートからテストできます。

source: This file is not in the default Craft installation so you may have to create it.
ja: このファイルは、デフォルトの Craft のインストールに含まれていないため、作成する必要があります。

source: This guide assumes you already have Craft installed and the default site setup and configured.
ja: このガイドは、すでに Craft がインストールされていて、デフォルトのセットアップや設定が済んでいることを前提としています。

source: This guide will walk you through all of the steps that are typically involved in setting up a localized site using Craft’s multi-site feature and translation support.
ja: これは、Craft のマルチサイト機能と翻訳サポートを利用して、一般的に必要となるすべてのステップを段階的に説明するガイドです。

source: This illustrates an N+1 query problem: In addition to the query executed to fetch the entries, an additional query will be executed for each entry, to find its related asset.
ja: これは N+1 クエリの問題を示しています。エントリを取り出すために実行されたクエリの他に、関連づけられたアセットを探すために それぞれの エントリで追加のクエリが実行されています。

source: This includes Craft Slack, Craft CMS Stack Exchange, GitHub, Twitter, Facebook, meetups, conferences, and any other relevant forums.
ja: Craft Slack、Craft CMS Stack Exchange、GitHub、Twitter、Facebook、会合、カンファレンス、その他すべての関連するフォーラムを含みます。

source: This includes, but is not limited to members of any race, ethnicity, culture, national origin, colour, immigration status, social and economic class, educational level, sex, sexual orientation, gender identity and expression, age, size, family status, political belief, religion, and mental and physical ability.
ja: これはいかなる人種、民族、文化、出身国、肌の色、移住ステータス、社会的・経済的地位、教育レベル、性別、性的指向、ジェンダー・アイデンティティーや表現、年齢、サイズ、家族的ステータス、政治理念、宗教、そして精神的・肉体的能力のメンバーであるかが含まれますが、これに制限されません。

source: This includes, but is not limited to:
ja: これは次のものを含みますが、この限りではありません。

source: This information can helpful to you when troubleshooting template loading, plugin action URLs, dynamic routes, and unexpected 404 errors.
ja: この情報は、テンプレートの読み込み、プラグインのアクション URL、動的なルート、および、予期しない 404 エラーのトラブルシューティングに役立ちます。

source: This is a Composer file that tells Composer exactly which dependencies and versions should be currently installed in vendor/.
ja: これは、vendor/へ現在インストールされている必要がある依存関係やバージョンを Composer へ正確に伝える Composer ファイルです。

source: This is a Windows Command Prompt wrapper for the craft executable.
ja: これは craft 実行可能プログラムの Windows コマンドプロンプト向けラッパーです。

source: This is a command line executable that will bootstrap a Craft console application.
ja: これは、Craft のコンソールアプリケーションを起動するコマンドライン実行可能プログラムです。

source: This is a comprehensive look at all of the changes made between Craft 2 and Craft 3.
ja: Craft 2 と Craft 3 のすべての変更点を包括的に確認できます。

source: This is enabled by default, and is the only option for Single and Structure sections.
ja: これはデフォルトで有効になっていて、シングルやストラクチャーセクションでは、必ず有効な状態となります。

source: This is helpful for creating taxonomies with multiple levels.
ja: これは複数レベルで分類を作成する際に役立ちます。

source: This is only meant as a primer, not a comprehensive documentation of everything Twig can do.
ja: これはあくまで入門書であり、 Twig が行うことができるすべての包括的なドキュメントではありません。

source: This is only necessary if you can’t set omitScriptNameInUrls to true, though.
ja: ただし、omitScriptNameInUrls を true にセットできない場合のみ、必要となります。

source: This is where Craft stores a bunch of files that get dynamically generated at runtime.
ja: ランタイムで動的に生成される一連のファイルを Craft が格納する場所です。

source: This is where all of your Composer dependencies go, including Craft itself, and any plugins you’ve installed via Composer.
ja: これは Composer で依存関係にあるすべてのもので、Craft 自身や Composer 経由でインストールしたすべてのプラグインが含まれます。

source: This is your PHP dotenv
ja: PHP dotenv の

source: This isn’t an exhaustive list of things that you can’t do.
ja: これはあなたがしてはいけないことすべてを網羅したリストではありません。

source: This parameter is required.
ja: このパラメータは必須です。

source: This problem can be solved with the withTransforms asset criteria parameter:
ja: この問題は、アセット基準パラメータの withTransforms で解決することができます。

source: This section displays both Craft CMS updates and plugin updates.
ja: このセクションには、Craft CMS のアップデートとプラグインのアップデートの両方を表示します。
